_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 200, 200, 32)      896       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 200, 200, 32)      9248      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 100, 100, 32)      0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 100, 100, 64)      18496     
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 100, 100, 64)      36928     
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 50, 50, 64)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 50, 50, 128)       73856     
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 50, 50, 128)       147584    
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 25, 25, 128)       0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 25, 25, 256)       295168    
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 25, 25, 256)       590080    
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 12, 12, 256)       0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 36864)             0         
_________________________________________________________________
dense_7 (Dense)              (None, 256)               9437440   
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               65792     
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 257       
_________________________________________________________________
activation_3 (Activation)    (None, 1)                 0         
=================================================================
Total params: 10,675,745
Trainable params: 10,675,745
Non-trainable params: 0
_________________________________________________________________
